app/Controllers/AdminController.php

SELECT *
FROM `usuarios`
WHERE `baja` = 'NO'
SELECT *
FROM `usuarios`
WHERE `baja` = 'SI'
SELECT *
FROM `productos`
WHERE `baja` = 'NO'
SELECT *
FROM `productos`
WHERE `baja` = 'SI'
---
    public function index()
    {
        $session = session();

        if (!$session->get('id_usuario')) {
            return redirect()->to('/login');
        }

        if ($session->get('perfil_id') == 1) {
            $userModel = new UserModel();
            $productoModel = new Productos_model();

            $data['usuarios'] = $userModel->where('baja', 'NO')->findAll();
            $data['usuariosBaja'] = $userModel->where('baja', 'SI')->findAll();

            $data['productos'] = $productoModel->where('baja', 'NO')->findAll();
            $data['productosBaja'] = $productoModel->where('baja', 'SI')->findAll();