app/Controllers/ProfileController.php

    public function index()
    {
        $session = session();
        $id = $session->get('id_usuario');

        $model = new UserModel();
        $usuario = $model->find($id);
---
SELECT *
FROM `usuarios`
WHERE `usuarios`.`id_usuario` = '10'

    public function update()
    {
        $session = session();
        $id = $session->get('id_usuario');
        $model = new UserModel();

        $usuario = $model->find($id);
---
SELECT *
FROM `usuarios`
WHERE `usuarios`.`id_usuario` = '10'