app/Controllers/SigninController.php

    public function loginAuth()
    {
        $session = session();
        $userModel = new UserModel();

        $userOrEmail = $this->request->getVar('usuario');
        $password = $this->request->getVar('pass');

        $user = $userModel->where('usuario', $userOrEmail)
                          ->orWhere('email', $userOrEmail)
                          ->first();
---
SELECT *
FROM `usuarios`
WHERE `usuario` = 'sarazarate'
OR `email` = 'sarazarate'
 LIMIT 1