app/Controllers/TiendaController.php

    public function index()
    {
        $productoModel = new Productos_model();
        $data['titulo'] = 'Tienda';
        $data['productos'] = $productoModel->where('baja', 'NO')->findAll();
---
SELECT *
FROM `productos`
WHERE `baja` = 'NO'