app/Controllers/Usuarios_controller.php

SELECT *
FROM `perfiles`
---
    public function create()
    {
        helper(['form', 'url']);
        $perfilModel = new Perfiles_model();
        $data['titulo'] = 'Registro';
        $data['perfiles'] = $perfilModel->findAll();